---
kind: method
id: M:Autodesk.Revit.DB.AngularDimension.SetAngularRadius(System.Double)
source: html/11de7cec-ac9b-72d5-054a-9c24ca88e84b.htm
---
# Autodesk.Revit.DB.AngularDimension.SetAngularRadius Method

Set radius of an Angular Dimension arc.
 The new radius of the arc.

## Syntax (C#)
```csharp
public void SetAngularRadius(
	double radius
)
```

## Parameters
- **radius** (`System.Double`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - The given value for radius must be non-negative.